app/Views/admin/presensi.php

SELECT COUNT(*) AS `numrows`
FROM `anggota_kelas`
WHERE `id_kelas` = '20'
---
                        $db = \Config\Database::connect();
                        $no = 1;
                        foreach ($kelas as $key => $value) {
                          $jml = $db->table('anggota_kelas')
                            ->where('id_kelas' ,$value['id_kelas'])
                            ->countAllResults();