app/Models/ModelMatkul.php

  public function allData()
  {
    return $this->db->table('matkul')
    ->join('prodi', 'prodi.id_prodi = matkul.id_prodi', 'left')
    ->orderBy('id_matkul', 'DESC')
    ->get()->getResultArray();
---
SELECT *
FROM `matkul`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `matkul`.`id_prodi`
ORDER BY `id_matkul` DESC