app/Models/ModelDosen.php

  public function allData()
  {
    return $this->db->table('dosen')
    ->orderBy('id_dosen', 'DESC')
    ->get()->getResultArray();
---
SELECT *
FROM `dosen`
ORDER BY `id_dosen` DESC