app/Models/ModelKelas.php

  public function allData()
  {
    return $this->db->table('kelas')
    ->join('prodi', 'prodi.id_prodi = kelas.id_prodi', 'left')
    ->join('dosen', 'dosen.id_dosen = kelas.id_dosen', 'left')
    ->join('th_akademik', 'th_akademik.id_ta = kelas.id_ta', 'left')
    ->join('matkul', 'matkul.id_matkul = kelas.id_matkul', 'left')
    ->orderBy('kelas.id_ta', 'DESC')
    ->get()->getResultArray();
---
SELECT *
FROM `kelas`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `kelas`.`id_prodi`
LEFT JOIN `dosen` ON `dosen`.`id_dosen` = `kelas`.`id_dosen`
LEFT JOIN `th_akademik` ON `th_akademik`.`id_ta` = `kelas`.`id_ta`
LEFT JOIN `matkul` ON `matkul`.`id_matkul` = `kelas`.`id_matkul`
ORDER BY `kelas`.`id_ta` DESC

  public function detailData($id_kelas)
  {
    return $this->db->table('kelas')
    ->join('prodi', 'prodi.id_prodi = kelas.id_prodi', 'left')
    ->join('dosen', 'dosen.id_dosen = kelas.id_dosen', 'left')
    ->join('th_akademik', 'th_akademik.id_ta = kelas.id_ta', 'left')
    ->join('matkul', 'matkul.id_matkul = kelas.id_matkul', 'left')
    ->where('id_kelas', $id_kelas)
    ->get()->getRowArray();
---
SELECT *
FROM `kelas`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `kelas`.`id_prodi`
LEFT JOIN `dosen` ON `dosen`.`id_dosen` = `kelas`.`id_dosen`
LEFT JOIN `th_akademik` ON `th_akademik`.`id_ta` = `kelas`.`id_ta`
LEFT JOIN `matkul` ON `matkul`.`id_matkul` = `kelas`.`id_matkul`
WHERE `id_kelas` = '19'

  public function mhs()
  {
    return $this->db->table('mahasiswa')
    ->join('prodi', 'prodi.id_prodi = mahasiswa.id_prodi', 'left')
    ->orderBy('id_mhs', 'DESC')
    ->get()->getResultArray();
---
SELECT *
FROM `mahasiswa`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `mahasiswa`.`id_prodi`
ORDER BY `id_mhs` DESC

  public function jml_anggota($id_kelas)
  {
    return $this->db->table('anggota_kelas')
    ->where('id_kelas', $id_kelas)
    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `anggota_kelas`
WHERE `id_kelas` = '19'

  public function anggotakelas($id_kelas)
  {
    return $this->db->table('anggota_kelas')
    ->join('mahasiswa', 'mahasiswa.id_mhs = anggota_kelas.id_mhs', 'left')
    ->where('anggota_kelas.id_kelas', $id_kelas)
    ->orderBy('anggota_kelas.id_mhs', 'DESC')
    ->get()->getResultArray();
---
SELECT *
FROM `anggota_kelas`
LEFT JOIN `mahasiswa` ON `mahasiswa`.`id_mhs` = `anggota_kelas`.`id_mhs`
WHERE `anggota_kelas`.`id_kelas` = '19'
ORDER BY `anggota_kelas`.`id_mhs` DESC