app/Models/ModelTA.php

SELECT *
FROM `th_akademik`
ORDER BY `id_ta` DESC
---
  public function allData()
  {
    return $this->db->table('th_akademik')
    ->orderBy('id_ta', 'DESC')
    ->get()->getResultArray();

SELECT *
FROM `th_akademik`
WHERE `status` = 1
---
  public function ta_aktif()
  {
    return $this->db->table('th_akademik')
    ->where('status',1)
    ->get()
    ->getRowArray();