app/Models/ModelProdi.php

  public function allData()
  {
    return $this->db->table('prodi')
    ->join('fakultas', 'fakultas.id_fakultas = prodi.id_fakultas', 'left')
    ->orderBy('fakultas.id_fakultas', 'ASC')
    ->get()->getResultArray();
---
SELECT *
FROM `prodi`
LEFT JOIN `fakultas` ON `fakultas`.`id_fakultas` = `prodi`.`id_fakultas`
ORDER BY `fakultas`.`id_fakultas` ASC